{
  "nav_whitepaper_tab": "Whitepaper",
  "nav_roadmap_tab": "Development Roadmap",
  "nav_roadmap_timeline_tab": "Timeline Roadmap",
  "game_title": "CHUP: Multi-Kingdom Open World with Unique PvP and PvE Mechanics",
  "whitepaper_welcome_message": "Welcome to CHUP, a vast open world divided into four distinct kingdoms: Colony, Homestead, Utopia, and Paragon. Each kingdom not only bears a meaningful name but also serves as the starting point for players' unique adventures and experiences.",
  "whitepaper_explore_world_title": "Explore the Vast World",
  "whitepaper_explore_world_content": "The world of CHUP consists of a total of 40 maps, including 4 maps corresponding to the four main kingdoms. Each kingdom has 10 teleportation gates: 9 gates lead to 36 diverse combat maps where players can grind levels, complete quests, and collect valuable rewards. The remaining gate connects directly between kingdoms, facilitating interaction and competition among the player community.",
  "1": "Engaging PvP and PvE Mechanics",
  "2": "CHUP offers a perfect combination of PvP (Player versus Player) and PvE (Player versus Environment) mechanics. On the 36 combat maps, players can freely engage in fierce battles with other players or team up to conquer PvE challenges, defeat monsters, and overcome difficult stages. Rewards for completing quests will be tokens, distributed equally among team members or individually if done alone. Players can interact with NPCs in the kingdom to receive quests and explore the game's storyline.",
  "3": "Diverse Character and Profession System",
  "4": "When starting their journey in CHUP, players' characters will be ordinary individuals without any special powers. However, during character creation, players will choose from a rich profession system and decide which kingdom they will first set foot in, thereby determining their \"nationality\" in the game world. Each profession will have distinct skill advantages, for example, doctors excel at healing and first aid, hunters are known for their accuracy with bows, and athletes possess abundant stamina. Through exploration and combat, players can collect experience points to upgrade weapons and personal skills.",
  "5": "Points and Tokens - In-Game Economic Foundation",
  "7": "$PHC (Primary Hub Coin): This is the main currency in CHUP, used for player-to-player trading, exchanging NFTs (Non-Fungible Tokens) like weapons, costumes, props, etc. Players can earn $PHC by completing quests or defeating other players. Earned through player transactions, NFT trading, and quest completion.",
  "8": "$PCOIN (Primary Coin): This secondary currency is used to upgrade character skill stats and improve stat-affecting items, most of which are NFTs. Obtained when players participate in professional activities within the kingdom (animal husbandry, farming, delivery, hunting) or defeat monsters on combat maps.",
  "9": "NFT - Digitized Value Assets",
  "10": "NFTs in CHUP include weapons, costumes, and other props that players can freely trade and own. Weapons are initially at level 0 and can be upgraded to a maximum of level 100 using $PCOIN. Changes in level will be accompanied by changes in the display color of weapons and costumes:",
  "12": "Level 0-10: Brown",
  "13": "Level 11-20: White",
  "14": "Level 21-30: Yellow",
  "15": "Level 31-40: Cyan",
  "16": "Level 41-50 (max): Orange",
  "17": "Special Weapons - Legends of the World",
  "18": "In addition to common items, CHUP features three special, legendary-level weapons (equivalent to level 100), randomly dropped by the publisher on the 36 combat maps, not appearing in kingdom areas. These three weapons are unique and have no duplicates:",
  "20": "CP-115 (Rank 3):",
  "21": "A weapon with no fixed form, capable of transforming into various weapon types like guns, swords, bows, crossbows, with almost absolute destructive power.",
  "22": "Syntax Orb (Rank 2):",
  "23": "Allows the owner to instantly teleport to any location on the entire server.",
  "24": "(Rank 1):",
  "25": "An undisclosed mystery, promised to be the most powerful item in the world of CHUP.",
  "26": "These legendary weapons can be traded among players, and their value is undoubtedly significant. Each day, the system will randomly drop one of these three weapons on the combat maps. When a player possesses a legendary weapon, the drop event will pause until the weapon is lost (if the owner is defeated and no one picks it up within 15 minutes, the system will retrieve it).",
  "27": "Combat and Non-Combat Zones",
  "28": "The combat maps (36 maps) are where players can freely engage in PvP and PvE. Conversely, kingdom areas are safe zones where all forms of combat are prohibited.",
  "29": "Combat Maps - Place of Challenge and Survival",
  "30": "Each combat map has unique terrain and geographical features. Players entering these areas must always remember the motto \"kill or be killed.\" Teaming up is a smart choice to increase survival chances, as danger can come from both NPC monsters and other players.",
  "overview_title": "1. Gameplay & Player Experience",
  "31": "Ensuring Fairness",
  "overview_content": "To address the concern of new players being \"farmed,\" CHUP introduces a character leveling system, capped at 100.",
  "32": "Players from level 1-20 are considered \"new players\" and can only receive level 1-10 quests in separate PvE maps (no PvP), with rewards being only $PCOIN. Each level-up during this phase grants 1 $PHC and 1000 $PCOIN.",
  "33": "$PHC is only rewarded for completing quests on maps with both PvP and PvE.",
  "34": "Upon reaching level 20, players are considered capable of handling PvP situations.",
  "35": "Profession System",
  "36": "Develop a diverse ecosystem of secondary professions, creating interaction and mutual dependence among players (e.g., doctors are essential for parties, blacksmiths craft weapons,...):",
  "37": "Professions like doctor, blacksmith, delivery person,... support PvP and PvE.",
  "38": "There are profession rankings and a hall of fame, fostering continuous competition among players.",
  "39": "Karma / Reputation System",
  "40": "Bad players (excessive PKing, guild betrayal) are marked red, find it difficult to enter other nations, face increased prices from merchants, etc.",
  "gameplay_title": "2. Tokenomics ($PHC and $PCOIN)",
  "41": "Token Burn Mechanism: Apply a 5% gas fee burn for each transaction using $PHC and an amount of $PCOIN when upgrading items to control inflation.",
  "42": "NFT Supply Control: Limit quantity and create clear power distinctions between NFTs to ensure balance between paying and free-to-play players, adhering to the \"play to earn, not pay to win\" motto.",
  "player_journey_title": "3. NFT & Legendary Weapons",
  "43": "Profession NFTs can be upgraded/traded, e.g., \"high-level doctor\" certificate; higher levels are rarer, increasing value.",
  "44": "Transparency in Item Drops: Ensure public tracking and verification of legendary weapon drop events on the blockchain, avoiding any suspicion of publisher interference.",
  "45": "High-Level Weapon Upgrade Risk: Level 41-50 weapons (orange) will have risks when upgrading and consume both $PCOIN and a small amount of $PHC, increasing rarity and preventing players from reaching max gear too easily.",
  "46": "Legendary Weapon Retrieval Mechanism: When a legendary weapon is owned, the drop event ends. If the owner is defeated and the weapon is not picked up within 15 minutes, the system will automatically retrieve it and reactivate the drop event later.",
  "47": "Zero-Knowledge Proof (ZKP) Integration: Use ZKP to authenticate the randomness and fairness of legendary weapon drops, ensuring no publisher interference. Drop events are generated based on unpredictable data (e.g., block hash, server time), and zk-SNARK proof will be published for community verification.",
  "elements_class_title": "4. Web3 Experience",
  "48": "Convenient Web3 Wallet Integration: Design a guest login system and subsequent wallet linking for players to easily access and familiarize themselves with Web3 technology.",
  "49": "Future DAO Governance: Empower the community through a DAO system, allowing players to vote on events, new maps, item drop limits, etc.",
  "50": "Integrate NFT & digital assets to protect the value of players' time and skills.",
  "weapons_items_title": "5. Community Development and Expansion",
  "51": "Nationality and Guilds: Each kingdom has its own nationality, providing a solid foundation for community development by region or guild. A kingdom can have multiple different guilds, similar to a multi-party system.",
  "52": "Inter-Kingdom Events: Organize large-scale events between kingdoms such as war zones, resource plundering, and national wars. In these events, the maps of the four kingdoms will merge into a special combat map. Players will not lose items upon death during the event, and the kingdom's resources will change based on combat results. Guilds within the same kingdom will have to unite to fight for common interests.",
  "53": "Guild System and Profession Rankings: Develop a strong guild system and ranking boards for each profession to increase competitiveness and long-term player retention.",
  "54": "\"One Life\" Mechanism: This is a core element that differentiates CHUP. When a character dies, the player loses all items (which can be picked up by other players or retrieved by the system after 15 minutes). After recreating a character, the player returns to level 1 but receives 2x experience in the early stages to catch up quickly. This mechanism encourages players to make cautious combat decisions, similar to the real world.",
  "anti_hack_security_title": "6. AI-Powered Anti-Hack Measures",
  "55": "Any behavior that exceeds normal thresholds will be flagged as suspicious. For example: auto-aim, auto-pathing, macro farming, or using scripts for repetitive actions without player input.",
  "anti_hack_sub_heading_1": "Intelligent Behavior Monitoring System",
  "56": "A machine learning system is trained to distinguish real players from bots through:",
  "anti_hack_security_item1": "Movement and attack speed",
  "anti_hack_security_item2": "Hit rate/monsters killed in PvE",
  "anti_hack_security_item3": "Reaction time in PvP",
  "anti_hack_security_item4": "Interaction patterns with NPCs and repetitive behaviors",
  "anti_hack_sub_heading_2": "Bot Detection System",
  "anti_hack_security_item3_sub1": "Mouse/finger movement patterns (mobile)",
  "anti_hack_security_item3_sub2": "Keystroke frequency",
  "anti_hack_security_item3_sub3": "Long-term behavioral changes",
  "57": "Additionally, the system will randomly require players to perform short verification tasks (micro-validation), e.g., selecting the correct icon as instructed, performing skill combos in the correct order,... in suspicious situations.",
  "anti_hack_sub_heading_3": "AI Blockchain Data Analysis",
  "58": "Since CHUP is deeply integrated with the blockchain, the AI system also monitors NFT and token transactions to detect economic anomalies, such as:",
  "59": "High-frequency item transfers between related wallets",
  "60": "Repeated transactions at unreasonable prices",
  "61": "Unnatural token farming loops",
  "62": "From there, AI will send alerts to the admin department or automatically freeze accounts/wallets if a high suspicion threshold is met.",
  "anti_hack_sub_heading_4": "\"Zero Tolerance\" Mechanism",
  "63": "Once AI detects fraudulent behavior:",
  "64": "Accounts may be permanently disabled for clear violations.",
  "65": "Fraudulent NFTs are frozen from the marketplace system (cannot be traded).",
  "66": "In minor cases, players will have their reputation reduced, affecting access to other kingdoms or restricting professional activities during verification.",
  "anti_hack_sub_heading_5": "AI Edge Computing Technology Integration",
  "67": "To speed up fraud detection, CHUP uses an edge-based AI model embedded directly in the game client, helping to detect auto-clickers, injectors, and cheat engines early without sending all data to the server, thereby reducing latency and saving resources.",
  "roadmap_main_title": "MVP (Minimum Viable Product) Development Roadmap",
  "roadmap_intro": "To ensure feasibility and test core experience quality before expansion, CHUP will be developed according to a clear phased roadmap:",
  "roadmap_stage1_title": "Stage 1: MVP Launch (Minimum)",
  "roadmap_stage1_item1": "A Single Kingdom selected as the starting point (e.g., Colony), where players will experience foundational gameplay mechanics.",
  "roadmap_stage1_item2": "First 4 Maps:",
  "roadmap_stage1_item2_sub1": "2 PvE maps (for leveling, monster hunting, questing)",
  "roadmap_stage1_item2_sub2": "1 mixed PvE/PvP map (for later PvP testing phase)",
  "roadmap_stage1_item2_sub3": "1 training map (controlled PvP duels)",
  "roadmap_stage1_item3": "1 Profession/Character Class unlocked first (e.g., Hunter – focused on ranged combat, suitable for testing combat mechanics)",
  "roadmap_stage1_item4": "Minimal Web3 Integration:",
  "roadmap_stage1_item4_sub1": "Web3 wallet connectable after guest login",
  "roadmap_stage1_item4_sub2": "Basic $PCOIN token and weapon NFTs",
  "roadmap_dev_test_title": "Phased Development & Community Testing",
  "roadmap_dev_test_intro": "To ensure all features are thoroughly tested, each gameplay component will be tested separately with the community according to the following roadmap:",
  "roadmap_pve_testing_title": "PvE Testing Phase (Closed Alpha):",
  "roadmap_pve_testing_item1": "Focus on quests, monsters, AI, and $PCOIN reward system",
  "roadmap_pve_testing_item2": "Test individual and party experiences",
  "roadmap_pve_testing_item3": "Balance items, drop rates, profession stats",
  "roadmap_pvp_testing_title": "PvP Testing Phase (Open Beta PvP Limited):",
  "roadmap_pvp_testing_item1": "Activate PvP in mixed map",
  "roadmap_pvp_testing_item2": "Test player-to-player damage, skill interactions, \"One Life\" death system",
  "roadmap_pvp_testing_item3": "Measure server performance during large-scale battles",
  "roadmap_guild_dao_title": "Guild & DAO Phase (Beta Late Stage):",
  "roadmap_guild_dao_item1": "Open guild functionality and profession leaderboards",
  "roadmap_guild_dao_item2": "Allow players to vote on the first test event via DAO",
  "roadmap_guild_dao_item3": "Integrate internal test NFT marketplace",
  "roadmap_target_player_title": "Target Player Orientation",
  "roadmap_target_player_intro": "CHUP is not a casual game for everyone – it is built for:",
  "roadmap_target_player_item1": "Hardcore MMO players who love survival genres requiring high skill and tactics.",
  "roadmap_target_player_item2": "Those with a basic understanding of blockchain and tokens/NFTs, willing to invest time in a game with real rewards and fierce competition.",
  "roadmap_timeline_main_title": "Timeline Roadmap",
  "roadmap_timeline_header_time": "Time",
  "roadmap_timeline_header_objective": "Objective",
  "roadmap_timeline_header_content": "Content",
  "roadmap_timeline_q3_2025_time": "Q3 2025",
  "roadmap_timeline_q3_2025_objective": "MVP Design & Development Kick-off",
  "roadmap_timeline_q3_2025_content": "- Form dev team - Build first kingdom - Design characters & basic PvE maps - Smart contract for $PCOIN & weapon NFTs",
  "roadmap_timeline_q4_2025_time": "Q4 2025",
  "roadmap_timeline_q4_2025_objective": "PvE Closed Alpha",
  "roadmap_timeline_q4_2025_content": "- Open internal PvE testing - Balance gameplay, quests - Launch testnet Web3 wallet & NFT inventory",
  "roadmap_timeline_q1_2026_time": "Q1 2026",
  "roadmap_timeline_q1_2026_objective": "PvP Open Beta (Limited)",
  "roadmap_timeline_q1_2026_content": "- Open limited PvP arena - Apply \"One Life\" mechanism - Monitor performance & log combat data",
  "roadmap_timeline_q2_2026_time": "Q2 2026",
  "roadmap_timeline_q2_2026_objective": "Guild & DAO Integration",
  "roadmap_timeline_q2_2026_content": "- Open guild system - Test voting for maps & events - First internal marketplace transaction",
  "roadmap_timeline_q3_2026_time": "Q3 2026",
  "roadmap_timeline_q3_2026_objective": "Expand to 4 Kingdoms",
  "roadmap_timeline_q3_2026_content": "- Open more classes - Officially launch 4 main kingdoms - 36 combat maps & inter-kingdom events",
  "roadmap_timeline_q4_2026_time": "Q4 2026",
  "roadmap_timeline_q4_2026_objective": "CHUP Full Launch",
  "roadmap_timeline_q4_2026_content": "- Full Open World - Open legendary weapon drop event - Implement ZK Proof system for transparent item drops",
  "footer_copyright": "© 2025 Elemental Conquest. All rights reserved."
}